<?php
session_start();


if (isset($_SESSION['user'])) {
    require_once('back-files/connect.php');
    require('back-files/find-user-position-in-top.php');
    require('back-files/get-user-friends.php');

    $current_user_id = $_SESSION['user']['id'];
    $current_user_in_top = findUserPositionInTop($current_user_id, $connect);
    $current_user_blossom_level = $connect->query("SELECT blossom_level FROM users WHERE id = '$current_user_id'")->fetch_assoc()['blossom_level'];

    $sql_top = "SELECT username, first_name, second_name, avatar, plat_status, blossom_level FROM users ORDER BY blossom_level DESC, blossom_progress DESC";
    $result_top = $connect->query($sql_top);
    $users_counter = $connect->query("SELECT 1 FROM users")->num_rows;
}
?>

<!DOCTYPE html>
<html lang="ru">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1">
    <link rel="stylesheet" href="css/main.css?v=300beta">
    <link rel="stylesheet" href="css/people.css?v=300beta">
    <title>Пользователи в Рампус</title>
    <link rel="apple-touch-icon" sizes="180x180" href="favicons/apple-touch-icon.png">
    <link rel="icon" type="image/png" sizes="32x32" href="favicons/favicon-32x32.png">
    <link rel="icon" type="image/png" sizes="16x16" href="favicons/favicon-16x16.png">
    <link rel="manifest" href="favicons/site.webmanifest">
</head>

<body>
    <?php require_once('components/header.php'); ?>
    <main>
        <h1 class="title">Все пользователи в Рампус</h1>
        <?php if (!isset($_SESSION['user'])) {
            header("Location: auth?request=people");
            exit();
        } else { ?>
            <section class="wrapper main-section">
                <?php require_once('components/main-menu.php'); ?>
                <div class="second-and-third-parts">
                    <div class="second-part">
                        <div class="people-filter-mobile" id="people-filter-mobile">
                            <div class='people-filter__choice'>
                                <label class="people-filter-popup-li" id="people-filter-top__mobile">Рейтинг<span>По уровню Цветения</span><input checked name="people-filter__mobile" type="radio" value=""></label>
                                <label class="people-filter-popup-li" id="people-filter-all__mobile">Все<span>Поиск пользователей</span><input name="people-filter__mobile" type="radio" value=""></label>
                            </div>
                            <div class="user-in-top">
                                <a href="blossom" class="user-in-top-info">
                                    <div>
                                        <span><?= $current_user_in_top ?> место</span>
                                        <span>Cейчас на <?= $current_user_blossom_level ?> уровне</span>
                                    </div>
                                    <svg class='pointer' width='8' height='13' viewBox='0 0 8 13' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                        <path d='M6.96771 6.03603L1.12165 0.191904C0.865127 -0.0639698 0.449521 -0.0639698 0.192352 0.191904C-0.0641698 0.447777 -0.0641699 0.863383 0.192352 1.11926L5.57471 6.49968L0.192999 11.8801C-0.0635223 12.136 -0.0635224 12.5516 0.192999 12.8081C0.44952 13.064 0.865774 13.064 1.1223 12.8081L6.96836 6.96403C7.22094 6.7108 7.22094 6.28866 6.96771 6.03603Z' />
                                    </svg>
                                </a>
                            </div>
                        </div>
                        <div class="people__top-users" id="users-filter-top">
                            <p>Рейтинг</p>
                            <div class="top-users">
                                <?php if ($result_top->num_rows > 0) {
                                    $counter = $result_top->num_rows;
                                    $counter_top = 0;
                                    while ($row = $result_top->fetch_assoc()) {
                                        $counter -= 1;
                                        $counter_top += 1;
                                        $other_user_first_name = $row['first_name'];
                                        $other_user_second_name = $row['second_name'];
                                        $other_user_username = $row['username'];
                                        $other_user_plat_status = $row['plat_status'];
                                        $other_user_avatar = $row['avatar'];
                                        $other_user_blossom_level = $row['blossom_level'];
                                        echo "<li class='user' onclick='openOtherUserProfile(event, `$other_user_username`)'>";
                                        switch ($counter_top) {
                                            case 1:
                                                echo "<svg width='28' height='28' viewBox='0 0 28 28' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                                <path d='M12.9279 0.596388C13.4228 -0.198796 14.5772 -0.198796 15.0721 0.596387L15.2392 0.864906C15.6417 1.51156 16.518 1.65824 17.1079 1.17771L17.3529 0.978176C18.0784 0.387274 19.1702 0.76325 19.3809 1.67654L19.452 1.98495C19.6234 2.72765 20.4047 3.1518 21.1183 2.88947L21.4146 2.78054C22.292 2.45795 23.2029 3.16916 23.1066 4.1016L23.074 4.41647C22.9957 5.17473 23.5974 5.83039 24.3572 5.81468L24.6727 5.80816C25.607 5.78885 26.2384 6.75822 25.8454 7.60875L25.7128 7.89596C25.3932 8.58763 25.7501 9.40374 26.4738 9.63636L26.7743 9.73295C27.6643 10.019 27.9476 11.1415 27.3007 11.818L27.0822 12.0464C26.5561 12.5965 26.6295 13.4846 27.2387 13.9404L27.4916 14.1296C28.2408 14.69 28.1454 15.844 27.3146 16.2731L27.034 16.418C26.3583 16.7669 26.1402 17.6308 26.5689 18.2603L26.7469 18.5217C27.2741 19.2957 26.8104 20.3561 25.8856 20.4913L25.5734 20.537C24.8213 20.6469 24.3354 21.393 24.5371 22.128L24.6209 22.4332C24.8689 23.337 24.0871 24.1889 23.1687 24.0156L22.8585 23.9571C22.1117 23.8161 21.4106 24.3635 21.3635 25.1244L21.3439 25.4403C21.2859 26.3759 20.2707 26.9271 19.4582 26.464L19.1838 26.3076C18.523 25.9311 17.6827 26.2204 17.3919 26.9247L17.2711 27.2172C16.9134 28.0832 15.7748 28.2738 15.1562 27.5712L14.9473 27.3339C14.4442 26.7625 13.5558 26.7625 13.0527 27.3339L12.8438 27.5712C12.2252 28.2738 11.0866 28.0832 10.7289 27.2172L10.6081 26.9247C10.3173 26.2204 9.47699 25.9311 8.81621 26.3076L8.54183 26.464C7.72928 26.9271 6.71407 26.3759 6.65611 25.4403L6.63653 25.1244C6.58939 24.3635 5.88832 23.8161 5.14145 23.9571L4.83132 24.0156C3.91291 24.1889 3.1311 23.337 3.37913 22.4332L3.46288 22.128C3.66458 21.393 3.17867 20.6469 2.42665 20.537L2.11438 20.4913C1.18963 20.3561 0.72594 19.2957 1.25309 18.5217L1.43109 18.2603C1.85978 17.6308 1.64168 16.7669 0.966004 16.418L0.685431 16.2731C-0.145446 15.844 -0.240771 14.69 0.508369 14.1296L0.76134 13.9404C1.37055 13.4846 1.44391 12.5965 0.917793 12.0464L0.699324 11.818C0.0523573 11.1415 0.335728 10.019 1.22568 9.73295L1.5262 9.63636C2.24992 9.40374 2.60679 8.58763 2.28724 7.89596L2.15455 7.60875C1.7616 6.75822 2.39296 5.78885 3.32729 5.80816L3.64279 5.81468C4.4026 5.83039 5.0043 5.17473 4.92595 4.41647L4.89342 4.1016C4.79707 3.16916 5.708 2.45795 6.58545 2.78054L6.88175 2.88947C7.5953 3.1518 8.37663 2.72765 8.54797 1.98495L8.61912 1.67655C8.82982 0.763251 9.9216 0.387274 10.6471 0.978176L10.8921 1.17771C11.482 1.65824 12.3583 1.51156 12.7608 0.864906L12.9279 0.596388Z' fill='#D5A021'/>
                                                <path d='M16.0417 8.16663V19.8333H13.736V10.6333L10.9298 12.5166L9.625 10.7833L13.593 8.16663H16.0417Z' fill='white'/>
                                                </svg>";
                                                break;
                                            case 2:
                                                echo "<svg width='28' height='28' viewBox='0 0 28 28' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                                <path d='M12.9279 0.596388C13.4228 -0.198796 14.5772 -0.198796 15.0721 0.596387L15.2392 0.864906C15.6417 1.51156 16.518 1.65824 17.1079 1.17771L17.3529 0.978175C18.0784 0.387274 19.1702 0.76325 19.3809 1.67654L19.452 1.98495C19.6234 2.72765 20.4047 3.1518 21.1183 2.88947L21.4146 2.78054C22.292 2.45795 23.2029 3.16916 23.1066 4.1016L23.074 4.41647C22.9957 5.17473 23.5974 5.83039 24.3572 5.81468L24.6727 5.80816C25.607 5.78885 26.2384 6.75822 25.8454 7.60875L25.7128 7.89596C25.3932 8.58763 25.7501 9.40374 26.4738 9.63636L26.7743 9.73295C27.6643 10.019 27.9476 11.1415 27.3007 11.818L27.0822 12.0464C26.5561 12.5965 26.6294 13.4846 27.2387 13.9404L27.4916 14.1296C28.2408 14.69 28.1454 15.844 27.3146 16.2731L27.034 16.418C26.3583 16.7669 26.1402 17.6308 26.5689 18.2603L26.7469 18.5217C27.2741 19.2957 26.8104 20.3561 25.8856 20.4913L25.5733 20.537C24.8213 20.6469 24.3354 21.393 24.5371 22.128L24.6209 22.4332C24.8689 23.337 24.0871 24.1889 23.1687 24.0156L22.8585 23.9571C22.1117 23.8161 21.4106 24.3635 21.3635 25.1244L21.3439 25.4403C21.2859 26.3759 20.2707 26.927 19.4582 26.464L19.1838 26.3076C18.523 25.9311 17.6827 26.2204 17.3919 26.9247L17.2711 27.2172C16.9134 28.0832 15.7748 28.2738 15.1562 27.5712L14.9473 27.3339C14.4442 26.7625 13.5558 26.7625 13.0527 27.3339L12.8438 27.5712C12.2252 28.2738 11.0866 28.0832 10.7289 27.2172L10.6081 26.9247C10.3173 26.2204 9.47699 25.9311 8.81621 26.3076L8.54183 26.464C7.72928 26.927 6.71407 26.3759 6.65611 25.4403L6.63653 25.1244C6.58939 24.3635 5.88832 23.8161 5.14145 23.9571L4.83132 24.0156C3.91291 24.1889 3.1311 23.337 3.37913 22.4332L3.46288 22.128C3.66458 21.393 3.17867 20.6469 2.42665 20.537L2.11438 20.4913C1.18963 20.3561 0.72594 19.2957 1.25309 18.5217L1.43109 18.2603C1.85978 17.6308 1.64168 16.7669 0.966004 16.418L0.685432 16.2731C-0.145446 15.844 -0.240771 14.69 0.508369 14.1296L0.76134 13.9404C1.37055 13.4846 1.44391 12.5965 0.917793 12.0464L0.699324 11.818C0.0523573 11.1415 0.335728 10.019 1.22568 9.73295L1.5262 9.63636C2.24992 9.40374 2.60679 8.58763 2.28724 7.89596L2.15455 7.60875C1.7616 6.75822 2.39296 5.78885 3.32729 5.80816L3.64279 5.81468C4.4026 5.83039 5.0043 5.17473 4.92595 4.41647L4.89342 4.1016C4.79707 3.16916 5.708 2.45795 6.58545 2.78054L6.88175 2.88947C7.5953 3.1518 8.37663 2.72765 8.54797 1.98495L8.61912 1.67655C8.82982 0.763251 9.9216 0.387274 10.6471 0.978175L10.8921 1.17771C11.482 1.65824 12.3583 1.51156 12.7608 0.864906L12.9279 0.596388Z' fill='#BAC7BE'/>
                                                <path d='M17.9935 12.1211C17.9935 13.3792 17.1619 14.6044 15.4985 15.7967L12.8755 17.7494H17.9935V19.8333H10.0606V17.4048L13.7712 14.6481C14.0804 14.4293 14.2883 14.2816 14.3949 14.2051C14.5122 14.1176 14.6935 13.9699 14.9387 13.762C15.184 13.5432 15.3599 13.3682 15.4665 13.2369C15.5731 13.0947 15.6744 12.9252 15.7704 12.7283C15.8664 12.5204 15.9143 12.3181 15.9143 12.1211C15.9143 11.5851 15.7277 11.1476 15.3546 10.8084C14.992 10.4693 14.5442 10.2998 14.0111 10.2998C12.9875 10.2998 12.305 10.8905 11.9638 12.0719L9.91663 11.4648C10.2152 10.4912 10.7057 9.69812 11.3881 9.08552C12.0811 8.47292 12.9555 8.16663 14.0111 8.16663C15.12 8.16663 16.0583 8.53856 16.826 9.28243C17.6044 10.0263 17.9935 10.9725 17.9935 12.1211Z' fill='white'/>
                                                </svg>";
                                                break;
                                            case 3:
                                                echo "<svg width='28' height='28' viewBox='0 0 28 28' fill='none' xmlns='http://www.w3.org/2000/svg'>
                                                <path d='M12.9279 0.596388C13.4228 -0.198796 14.5772 -0.198796 15.0721 0.596387L15.2392 0.864906C15.6417 1.51156 16.518 1.65824 17.1079 1.17771L17.3529 0.978175C18.0784 0.387274 19.1702 0.76325 19.3809 1.67654L19.452 1.98495C19.6234 2.72765 20.4047 3.1518 21.1183 2.88947L21.4146 2.78054C22.292 2.45795 23.2029 3.16916 23.1066 4.1016L23.074 4.41647C22.9957 5.17473 23.5974 5.83039 24.3572 5.81468L24.6727 5.80816C25.607 5.78885 26.2384 6.75822 25.8454 7.60875L25.7128 7.89596C25.3932 8.58763 25.7501 9.40374 26.4738 9.63636L26.7743 9.73295C27.6643 10.019 27.9476 11.1415 27.3007 11.818L27.0822 12.0464C26.5561 12.5965 26.6294 13.4846 27.2387 13.9404L27.4916 14.1296C28.2408 14.69 28.1454 15.844 27.3146 16.2731L27.034 16.418C26.3583 16.7669 26.1402 17.6308 26.5689 18.2603L26.7469 18.5217C27.2741 19.2957 26.8104 20.3561 25.8856 20.4913L25.5733 20.537C24.8213 20.6469 24.3354 21.393 24.5371 22.128L24.6209 22.4332C24.8689 23.337 24.0871 24.1889 23.1687 24.0156L22.8585 23.9571C22.1117 23.8161 21.4106 24.3635 21.3635 25.1244L21.3439 25.4403C21.2859 26.3759 20.2707 26.927 19.4582 26.464L19.1838 26.3076C18.523 25.9311 17.6827 26.2204 17.3919 26.9247L17.2711 27.2172C16.9134 28.0832 15.7748 28.2738 15.1562 27.5712L14.9473 27.3339C14.4442 26.7625 13.5558 26.7625 13.0527 27.3339L12.8438 27.5712C12.2252 28.2738 11.0866 28.0832 10.7289 27.2172L10.6081 26.9247C10.3173 26.2204 9.47699 25.9311 8.81621 26.3076L8.54183 26.464C7.72928 26.927 6.71407 26.3759 6.65611 25.4403L6.63653 25.1244C6.58939 24.3635 5.88832 23.8161 5.14145 23.9571L4.83132 24.0156C3.91291 24.1889 3.1311 23.337 3.37913 22.4332L3.46288 22.128C3.66458 21.393 3.17867 20.6469 2.42665 20.537L2.11438 20.4913C1.18963 20.3561 0.72594 19.2957 1.25309 18.5217L1.43109 18.2603C1.85978 17.6308 1.64168 16.7669 0.966004 16.418L0.685432 16.2731C-0.145446 15.844 -0.240771 14.69 0.508369 14.1296L0.76134 13.9404C1.37055 13.4846 1.44391 12.5965 0.917793 12.0464L0.699324 11.818C0.0523573 11.1415 0.335728 10.019 1.22568 9.73295L1.5262 9.63636C2.24992 9.40374 2.60679 8.58763 2.28724 7.89596L2.15455 7.60875C1.7616 6.75822 2.39296 5.78885 3.32729 5.80816L3.64279 5.81468C4.4026 5.83039 5.0043 5.17473 4.92595 4.41647L4.89342 4.1016C4.79707 3.16916 5.708 2.45795 6.58545 2.78054L6.88175 2.88947C7.5953 3.1518 8.37663 2.72765 8.54797 1.98495L8.61912 1.67655C8.82982 0.763251 9.9216 0.387274 10.6471 0.978175L10.8921 1.17771C11.482 1.65824 12.3583 1.51156 12.7608 0.864906L12.9279 0.596388Z' fill='#99621E'/>
                                                <path d='M15.512 13.2952C16.3215 13.4156 16.9724 13.7875 17.4647 14.411C17.9569 15.0236 18.2031 15.7839 18.2031 16.6919C18.2031 17.7967 17.8202 18.6937 17.0545 19.3829C16.2887 20.0721 15.2987 20.4167 14.0845 20.4167C13.0562 20.4167 12.1701 20.1377 11.4262 19.5798C10.6933 19.011 10.1901 18.2507 9.91663 17.299L11.9021 16.6262C12.0224 17.1513 12.2686 17.5615 12.6405 17.8569C13.0234 18.1413 13.4937 18.2835 14.0516 18.2835C14.6533 18.2835 15.1401 18.1304 15.512 17.8241C15.884 17.5178 16.0699 17.124 16.0699 16.6426C16.0699 16.0082 15.8183 15.5104 15.3151 15.1494C14.8229 14.7775 14.1392 14.5915 13.264 14.5915L12.8538 13.1147L15.7089 10.8339H10.0643V8.75H18.2031V11.1785L15.512 13.2952Z' fill='white'/>
                                                </svg>";
                                                break;
                                        }
                                        echo "<img class='other-user-avatar' src='uploads/avatar/thin_$other_user_avatar'>";
                                        echo "<div class='current-user-info'>";
                                        $trust_mark = $other_user_username == 'rampus' || $other_user_username == 'help' ? ' trust' : '';
                                        if ($other_user_first_name || $other_user_second_name) {
                                            echo "<div class='f-and-s-names-and-plat'>";
                                            echo "<p class='$trust_mark'>$other_user_first_name $other_user_second_name</p>";
                                            require('components/plat-status.php');
                                            echo "</div>";
                                            echo "<p class='$trust_mark'>@<span>$other_user_username</span></p>";
                                        } else {
                                            echo "<div class='f-and-s-names-and-plat'>";
                                            echo "<p class='$trust_mark'>@<span>$other_user_username</span></p>";
                                            require('components/plat-status.php');
                                            echo "</div>";
                                        }
                                        if ($other_user_username == 'rampus' || $other_user_username == 'help') {
                                            echo "<img class='status' src='pics/SuperUserIcon.svg'>";
                                        }
                                        echo "</div>";
                                        echo "<div class='blossom-status'><img src='pics/BlossomIcon.svg'>$other_user_blossom_level<span>уровень</span></div>";
                                        echo "</li>";
                                        if ($counter > 0) {
                                            echo "<div class='div-line'></div>";
                                        }
                                    }
                                } ?>
                            </div>
                        </div>
                        <div class="people people__users" id="users-filter-all">
                            <p>Пользователи<span><?= $users_counter ?></span></p>
                            <div class="search-people-div">
                                <input type="text" name="search-people" id="search-people" placeholder="Поиск">
                                <img id="icon-search-people" src="pics/SearchIcon.svg">
                            </div>
                            <ul id="success-search-people">
                            </ul>
                        </div>
                        <?php require_once('components/mobile-main-menu.php') ?>
                    </div>
                    <div class="third-part">
                        <div>
                            <div>
                                <p class="third-part-title">Фильтры</p>
                                <div class='people-filter__choice'>
                                    <label class="people-filter-popup-li" id="people-filter-top">Рейтинг<span>По уровню Цветения</span><input checked name="people-filter" type="radio" value=""></label>
                                    <label class="people-filter-popup-li" id="people-filter-all">Все<span>Поиск пользователей</span><input name="people-filter" type="radio" value=""></label>
                                </div>
                            </div>
                            <div class="user-in-top">
                                <p class="third-part-title">Ваша позиция</p>
                                <a href="blossom" class="user-in-top-info">
                                    <div>
                                        <span><?= $current_user_in_top ?> место</span>
                                        <span>Cейчас на <?= $current_user_blossom_level ?> уровне</span>
                                    </div>
                                    <svg class="pointer" width="8" height="13" viewBox="0 0 8 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M6.96771 6.03603L1.12165 0.191904C0.865127 -0.0639698 0.449521 -0.0639698 0.192352 0.191904C-0.0641698 0.447777 -0.0641699 0.863383 0.192352 1.11926L5.57471 6.49968L0.192999 11.8801C-0.0635223 12.136 -0.0635224 12.5516 0.192999 12.8081C0.44952 13.064 0.865774 13.064 1.1223 12.8081L6.96836 6.96403C7.22094 6.7108 7.22094 6.28866 6.96771 6.03603Z" />
                                    </svg>
                                </a>
                            </div>
                        </div>
                    </div>
            </section>
    </main>
<?php require_once('components/footer.php');
        } ?>
<script src="https://code.jquery.com/jquery-3.7.1.min.js"></script>
<script src="js/main.js?v=300beta"></script>
<script src="js/people.js?v=300beta"></script>
</body>

</html>